#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; COLOR                    0   xyz         1     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyz         1     NONE   float   xyz 
;
; shader debug name: d1e59130ffad89db7a733c2999d82867.pdb
; shader hash: d1e59130ffad89db7a733c2999d82867
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; COLOR                    0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       
;
; Buffer Definitions:
;
; cbuffer ModelViewProjectionConstantBuffer
; {
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !36)
!1 = !DIFile(filename: "Pass1VS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 8, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 8, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 8, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 18, type: !18, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PixelShaderInput", file: !1, line: 11, size: 224, align: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !1, line: 13, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !20, file: !1, line: 14, baseType: !24, size: 96, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 8, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 8, size: 96, align: 32, elements: !26, templateParams: !30)
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 8, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 8, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexShaderInput", file: !1, line: 4, size: 192, align: 32, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !32, file: !1, line: 6, baseType: !24, size: 96, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !32, file: !1, line: 7, baseType: !24, size: 96, align: 32, offset: 96)
!36 = !{!37, !60, !61, !62, !69, !73, !75}
!37 = !DIGlobalVariable(name: "model", linkageName: "\01?model@ModelViewProjectionConstantBuffer@@3V?$matrix@M$03$03@@A", scope: !0, file: !38, line: 6, type: !39, isLocal: false, isDefinition: true)
!38 = !DIFile(filename: "./Bindings.hlsli", directory: "")
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 6, size: 512, align: 32, elements: !40, templateParams: !57)
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !39, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!57 = !{!13, !58, !59}
!58 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!59 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!60 = !DIGlobalVariable(name: "view", linkageName: "\01?view@ModelViewProjectionConstantBuffer@@3V?$matrix@M$03$03@@A", scope: !0, file: !38, line: 7, type: !39, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariable(name: "projection", linkageName: "\01?projection@ModelViewProjectionConstantBuffer@@3V?$matrix@M$03$03@@A", scope: !0, file: !38, line: 8, type: !39, isLocal: false, isDefinition: true)
!62 = !DIGlobalVariable(name: "drawConstants", linkageName: "\01?drawConstants@@3U?$ConstantBuffer@UDrawConstantsType@@@@A", scope: !0, file: !38, line: 15, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<DrawConstantsType>", file: !1, line: 15, size: 32, align: 32, elements: !2, templateParams: !64)
!64 = !{!65}
!65 = !DITemplateTypeParameter(name: "T", type: !66)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "DrawConstantsType", file: !38, line: 11, size: 32, align: 32, elements: !67)
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "samplerIndex", scope: !66, file: !38, line: 13, baseType: !15, size: 32, align: 32)
!69 = !DIGlobalVariable(name: "g_inputTexture", linkageName: "\01?g_inputTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !38, line: 17, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 17, size: 160, align: 32, elements: !2, templateParams: !71)
!71 = !{!72}
!72 = !DITemplateTypeParameter(name: "element", type: !5)
!73 = !DIGlobalVariable(name: "g_sampler0", linkageName: "\01?g_sampler0@@3USamplerState@@A", scope: !0, file: !38, line: 19, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 19, size: 32, align: 32, elements: !2)
!75 = !DIGlobalVariable(name: "g_sampler1", linkageName: "\01?g_sampler1@@3USamplerState@@A", scope: !0, file: !38, line: 20, type: !74, isLocal: false, isDefinition: true)
!76 = !{i32 2, !"Dwarf Version", i32 4}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!79 = !{!"Pass1VS.hlsl", !"#include \22Bindings.hlsli\22\0A\0A// Per-vertex data used as input to the vertex shader.\0Astruct VertexShaderInput\0A{\0A\09float3 pos : POSITION;\0A\09float3 color : COLOR0;\0A};\0A\0A// Per-pixel color data passed through the pixel shader.\0Astruct PixelShaderInput\0A{\0A\09float4 pos : SV_POSITION;\0A\09float3 color : COLOR0;\0A};\0A\0A// Simple shader to do vertex processing on the GPU.\0APixelShaderInput main(VertexShaderInput input)\0A{\0A\09PixelShaderInput output;\0A\09float4 pos = float4(input.pos, 1.0f);\0A\0A\09// Transform the vertex position into projected space.\0A\09pos = mul(pos, model);\0A\09pos = mul(pos, view);\0A\09pos = mul(pos, projection);\0A\09output.pos = pos;\0A\0A\09// Pass the color through without modification.\0A\09output.color = input.color;\0A\0A\09return output;\0A}\0A"}
!80 = !{!".\5CBindings.hlsli", !"#pragma once\0D\0A\0D\0A// A constant buffer that stores the three basic column-major matrices for composing geometry.\0D\0Acbuffer ModelViewProjectionConstantBuffer : register(b0)\0D\0A{\0D\0A\09matrix model;\0D\0A\09matrix view;\0D\0A\09matrix projection;\0D\0A};\0D\0A\0D\0Astruct DrawConstantsType\0D\0A{\0D\0A\09int samplerIndex;\0D\0A};\0D\0AConstantBuffer<DrawConstantsType> drawConstants : register(b1);\0D\0A\0D\0ATexture2D g_inputTexture : register(t0);\0D\0A\0D\0ASamplerState g_sampler0 : register(s0);\0D\0ASamplerState g_sampler1 : register(s1);\0D\0A"}
!81 = !{!"Pass1VS.hlsl"}
