#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEXCOORD                 0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 82a6c6762c13cf878a4b9b057a1a9707.pdb
; shader hash: 82a6c6762c13cf878a4b9b057a1a9707
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer drawConstants
; {
;
;   struct drawConstants
;   {
;
;       struct struct.DrawConstantsType
;       {
;
;           int samplerIndex;                         ; Offset:    0
;       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !30)
!1 = !DIFile(filename: "Pass2PS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "main", scope: !1, file: !1, line: 9, type: !5, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DISubroutineType(types: !6)
!6 = !{!7, !19}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 8, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 8, size: 128, align: 32, elements: !9, templateParams: !15)
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, line: 8, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, line: 8, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, line: 8, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !8, file: !1, line: 8, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!15 = !{!16, !17}
!16 = !DITemplateTypeParameter(name: "element", type: !11)
!17 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 4)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 3, size: 192, align: 32, elements: !20)
!20 = !{!21, !22}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !19, file: !1, line: 5, baseType: !7, size: 128, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !19, file: !1, line: 6, baseType: !23, size: 64, align: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 8, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 8, size: 64, align: 32, elements: !25, templateParams: !28)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 8, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 8, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !{!16, !29}
!29 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 2)
!30 = !{!31, !54, !55, !56, !63, !67, !69}
!31 = !DIGlobalVariable(name: "model", linkageName: "\01?model@ModelViewProjectionConstantBuffer@@3V?$matrix@M$03$03@@A", scope: !0, file: !32, line: 6, type: !33, isLocal: false, isDefinition: true)
!32 = !DIFile(filename: "./Bindings.hlsli", directory: "")
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 6, size: 512, align: 32, elements: !34, templateParams: !51)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !33, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!51 = !{!16, !52, !53}
!52 = !DITemplateValueParameter(name: "row_count", type: !18, value: i32 4)
!53 = !DITemplateValueParameter(name: "col_count", type: !18, value: i32 4)
!54 = !DIGlobalVariable(name: "view", linkageName: "\01?view@ModelViewProjectionConstantBuffer@@3V?$matrix@M$03$03@@A", scope: !0, file: !32, line: 7, type: !33, isLocal: false, isDefinition: true)
!55 = !DIGlobalVariable(name: "projection", linkageName: "\01?projection@ModelViewProjectionConstantBuffer@@3V?$matrix@M$03$03@@A", scope: !0, file: !32, line: 8, type: !33, isLocal: false, isDefinition: true)
!56 = !DIGlobalVariable(name: "drawConstants", linkageName: "\01?drawConstants@@3U?$ConstantBuffer@UDrawConstantsType@@@@A", scope: !0, file: !32, line: 15, type: !57, isLocal: false, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<DrawConstantsType>", file: !1, line: 15, size: 32, align: 32, elements: !2, templateParams: !58)
!58 = !{!59}
!59 = !DITemplateTypeParameter(name: "T", type: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "DrawConstantsType", file: !32, line: 11, size: 32, align: 32, elements: !61)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "samplerIndex", scope: !60, file: !32, line: 13, baseType: !18, size: 32, align: 32)
!63 = !DIGlobalVariable(name: "g_inputTexture", linkageName: "\01?g_inputTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !32, line: 17, type: !64, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?g_inputTexture@@3V?$Texture2D@V?$vector@M$03@@@@A")
!64 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 17, size: 160, align: 32, elements: !2, templateParams: !65)
!65 = !{!66}
!66 = !DITemplateTypeParameter(name: "element", type: !8)
!67 = !DIGlobalVariable(name: "g_sampler_point", linkageName: "\01?g_sampler_point@@3USamplerState@@A", scope: !0, file: !32, line: 19, type: !68, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?g_sampler_point@@3USamplerState@@A")
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 19, size: 32, align: 32, elements: !2)
!69 = !DIGlobalVariable(name: "g_sampler_linear", linkageName: "\01?g_sampler_linear@@3USamplerState@@A", scope: !0, file: !32, line: 20, type: !68, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?g_sampler_linear@@3USamplerState@@A")
!70 = !{i32 2, !"Dwarf Version", i32 4}
!71 = !{i32 2, !"Debug Info Version", i32 3}
!72 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!73 = !{!"Pass2PS.hlsl", !"#include \22Bindings.hlsli\22\0D\0A\0D\0Astruct PSInput\0D\0A{\0D\0A\09float4 position : SV_POSITION;\0D\0A\09float2 uv : TEXCOORD;\0D\0A};\0D\0A\0D\0Afloat4 main(PSInput input) : SV_TARGET\0D\0A{\0D\0A\09float2 uv = input.uv;\0D\0A\09if (drawConstants.samplerIndex == 0)\0D\0A\09{\0D\0A\09\09return g_inputTexture.Sample(g_sampler_point, uv);\0D\0A\09}\0D\0A\09else\0D\0A\09{\0D\0A\09\09return g_inputTexture.Sample(g_sampler_linear, uv);\0D\0A\09}\0D\0A}"}
!74 = !{!".\5CBindings.hlsli", !"#pragma once\0D\0A\0D\0A// A constant buffer that stores the three basic column-major matrices for composing geometry.\0D\0Acbuffer ModelViewProjectionConstantBuffer : register(b0)\0D\0A{\0D\0A\09matrix model;\0D\0A\09matrix view;\0D\0A\09matrix projection;\0D\0A};\0D\0A\0D\0Astruct DrawConstantsType\0D\0A{\0D\0A\09int samplerIndex;\0D\0A};\0D\0AConstantBuffer<DrawConstantsType> drawConstants : register(b3);\0D\0A\0D\0ATexture2D g_inputTexture : register(t0);\0D\0A\0D\0ASamplerState g_sampler_point : register(s0);\0D\0ASamplerState g_sampler_linear : register(s1);\0D\0A"}
!75 = !{!"Pass2PS.hlsl"}
